
export const examples = [
  `开始画画。
存在n从1到6，顺时针旋转60度并向前移动100像素。
存在n从1到3，顺时针旋转120度并向前移动100像素。`,

  `开始画画。
存在n从1到5，顺时针旋转180-36度并向前移动100像素。`,

  `开始画画。
令 N = 100。
令 a = 360 / N。
令 l = 5。
存在 n 从 1 到 N，顺时针旋转 a 度并向前移动 l 像素。`,

  `令 N = 20。 令 a = 360 / N。 令 l = 20。
顺时针旋转135度。 向前移动300像素。 逆时针旋转135度。
开始画画。
存在 n 从 1 到 N，如果 n% 10 >= 5则顺时针旋转 a 度并向前移动 l 像素，否则逆时针旋转a度并向前移动 l 像素。
结束画画。
逆时针旋转90度。
开始画画。
存在 n 从 1 到 N，顺时针旋转 a 度并向前移动 l 像素。
开始画画。
存在 n 从 1 到 N，如果 n% 10 >= 5则顺时针旋转 a 度并向前移动 l 像素，否则逆时针旋转a度并向前移动 l 像素。`,
];